[
  {
    "category": "career", 
    "url": "https://medium.freecodecamp.com/being-a-developer-after-40-3c5dd112210c", 
    "excerpt": "Hi everyone, I am a forty-two years old self-taught developer, and this is my story. I started my career as a software developer at precisely 10am, on Monday October 6th, 1997, somewhere in the city of Olivos, just north of Buenos Aires, Argentina. The moment was Unix Epoch 876142800. I had recently celebrated my 24th birthday.", 
    "title": "Being A Developer After 40"
  }, 
  {
    "url": "http://blog.karhatsu.com/2013/08/from-hour-estimates-gradually-to.html", 
    "category": "agile", 
    "excerpt": "This is my first blog post, welcome! I would like to share with you my real-life experience related to #NoEstimates. I've been following the discussion on Twitter this year but learned most of what I know by reading blogs. So maybe you can learn something from my post as well.", 
    "title": "From hour estimates gradually to #NoEstimates"
  }, 
  {
    "url": "http://markmanson.net/you-cant-have-it-all", 
    "category": "happiness", 
    "excerpt": "I saw a story on Facebook the other day. Like most stories that get passed around Facebook, it’s probably only 38% true and written by a 16-year-old. But regardless, I found it cool, and at the very least, thought-provoking.  It was about a man named Mohammed El-Erian.", 
    "title": "No, You Can’t Have It All"
  }, 
  {
    "url": "http://www.infoq.com/presentations/twitter-services", 
    "category": "java", 
    "excerpt": "Tony Printezis presents an overview of how services are deployed and monitored at Twitter; the benefits of using a custom-built JVM with in-house features and the challenges of the use of the JVM in an environment like Twitter.", 
    "title": "Life of a Twitter JVM Engineer"
  }, 
  {
    "url": "https://www.infoq.com/articles/how-make-agile-successful", 
    "category": "agile", 
    "excerpt": "Last year, I wrote an article (“Why Agile didn’t work”) that provoked a lot of discussion. Some people have been badly hurt by Agile, while others have had good experiences with Agile. These discussions usually boil down to the same conclusion: “it is not about process, it is about people.", 
    "title": "So, How Do You Make Agile Successful?"
  }, 
  {
    "url": "http://continuousdelivery.com/2011/05/make-large-scale-changes-incrementally-with-branch-by-abstraction/", 
    "category": "programming", 
    "excerpt": "Many development teams are used to making heavy use of branches in version control. Distributed version control systems make this even more convenient. Thus one of the more controversial statements in Continuous Delivery is that you can’t do continuous integration and use branches.", 
    "title": "Make Large Scale Changes Incrementally with Branch By Abstraction"
  }, 
  {
    "url": "https://newint.org/columns/essays/2016/04/01/psycho-spiritual-crisis/", 
    "category": "happiness", 
    "excerpt": "Western consumer culture is creating a psycho-spiritual crisis that leaves us disoriented and bereft of purpose. How can we treat our sick culture and make ourselves well? asks John F Schumaker.  Our descent into the Age of Depression seems unstoppable.", 
    "title": "The demoralized mind"
  }, 
  {
    "url": "http://martinfowler.com/bliki/CraftmanshipAndTheCrevasse.html", 
    "category": "agile", 
    "excerpt": "Dan North's recent blog post on software craftsmanship has   unleashed a lot of blog discussions (which I summarize below, if   you're interested). There's a lot in there, but one of his themes   particularly resonated with me, hence this post.", 
    "title": "CraftmanshipAndTheCrevasse"
  }, 
  {
    "url": "https://www.youtube.com/watch?list=PLpi1lPB6opQzSSOQU8JQLExuP1JUXPtmA&v=JC-UJwBKc2Y", 
    "category": "programming", 
    "excerpt": "Brennan Saeta, CourseraCoursera’s educational platform has a broad API surface implemented in a standardized, sophisticated HTTP/JSON framework backed by a distributed microservice architecture. However, one of the biggest challenges engineers face is assembling all the data required to render the", 
    "title": "Coursera's API Evolution"
  }, 
  {
    "url": "https://www.thekua.com/atwork/2016/11/the-well-rounded-architect/", 
    "category": "programming", 
    "excerpt": "Good software architects understand that their role as a leader is not necessarily telling developers what to do.", 
    "title": "The Well Rounded Architect"
  }, 
  {
    "url": "http://glen.nu/ramblings/oncodereview.php", 
    "category": "programming", 
    "excerpt": "A question that comes up in 1:1s from time to time is \"how much time should I be spending on code reviews?\" The short answer is \"as long as it takes.\" Minimally, your day should begin and end with clearing your code-review backlog.", 
    "title": "Expect to spend time on code review every day, throughout the day"
  }
]