[
  {
    "category": "career", 
    "url": "https://medium.freecodecamp.com/being-a-developer-after-40-3c5dd112210c", 
    "excerpt": "Hi everyone, I am a forty-two years old self-taught developer, and this is my story. I started my career as a software developer at precisely 10am, on Monday October 6th, 1997, somewhere in the city of Olivos, just north of Buenos Aires, Argentina. The moment was Unix Epoch 876142800. I had recently celebrated my 24th birthday.", 
    "title": "Being A Developer After 40"
  }, 
  {
    "url": "http://blog.karhatsu.com/2013/08/from-hour-estimates-gradually-to.html", 
    "category": "agile", 
    "excerpt": "This is my first blog post, welcome! I would like to share with you my real-life experience related to #NoEstimates. I've been following the discussion on Twitter this year but learned most of what I know by reading blogs. So maybe you can learn something from my post as well.", 
    "title": "From hour estimates gradually to #NoEstimates"
  }, 
  {
    "url": "http://markmanson.net/you-cant-have-it-all", 
    "category": "happiness", 
    "excerpt": "I saw a story on Facebook the other day. Like most stories that get passed around Facebook, it’s probably only 38% true and written by a 16-year-old. But regardless, I found it cool, and at the very least, thought-provoking.  It was about a man named Mohammed El-Erian.", 
    "title": "No, You Can’t Have It All"
  }, 
  {
    "url": "http://www.infoq.com/presentations/twitter-services", 
    "category": "java", 
    "excerpt": "You are now in FULL VIEW       by  on Apr 10, 2016 |                                   Sponsored Content      Cloud-Based Java Development: Choosing the Right PaaS Oracle       Cloudy with 100% Visibility: Monitoring Application Performance in Hybrid Clouds New Relic", 
    "title": "Life of a Twitter JVM Engineer"
  }, 
  {
    "url": "https://www.infoq.com/articles/how-make-agile-successful", 
    "category": "agile", 
    "excerpt": "Last year, I wrote an article (“Why Agile didn’t work”) that provoked a lot of discussion. Some people have been badly hurt by Agile, while others have had good experiences with Agile. These discussions usually boil down to the same conclusion: “it is not about process, it is about people.", 
    "title": "So, How Do You Make Agile Successful?"
  }, 
  {
    "url": "http://continuousdelivery.com/2011/05/make-large-scale-changes-incrementally-with-branch-by-abstraction/", 
    "category": "programming", 
    "excerpt": "Many development teams are used to making heavy use of branches in version control. Distributed version control systems make this even more convenient. Thus one of the more controversial statements in Continuous Delivery is that you can’t do continuous integration and use branches.", 
    "title": "Make Large Scale Changes Incrementally with Branch By Abstraction"
  }
]